000_РОЗНИЦА_ЦЕНТР/src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйКассовыйОрдер</name>
  <basedOn>Document.ВозвратТоваровОтПокупателя</basedOn>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <basedOn>Document.ПриходныйКассовыйОрдер</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ЗарплатаКВыплатеОрганизаций</basedOn>
  <basedOn>Document.ЗаявкаНаРасходованиеДенежныхСредств</basedOn>
  <registerRecords>AccumulationRegister.ДенежныеСредстваКВыплате</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваКПоступлениюНаличные</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваНаличные</registerRecords>
  <registerRecords>InformationRegister.ВыплаченнаяЗарплата</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваККМ</registerRecords>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдать</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ЗарплатаКВыплатеОрганизаций</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаПолучатель</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОрдера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСумки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежнаяВедомость</name>
    <type>
      <types>DocumentRef.ЗарплатаКВыплатеОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДокументу</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проводился</name>
    <comment>(Служебный)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРасчетовСКонтрагентом</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.ПоступлениеТоваров</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаОписьСдаваемыхНаличныхДенег</name>
    <attributes>
      <name>Номинал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБанкнот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеБанкноты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрКоличествоБанкнот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрСуммаБанкнот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Кассы/Кассы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кассы</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоОбособленномуПодразделению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВКассовойКниге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/БанковскиеСчетаОрганизаций/БанковскиеСчетаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчетаОрганизаций</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>АдресБанка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСчета</name>
    <comment>(Общ) Расчетный, депозитный, ссудный, иной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <comment>(Общ) Дата закрытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <comment>(Общ) Дата открытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаРазрешения</name>
    <comment>(Регл) Номер и дата разрешения открытия счета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>29</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеИзменениеРеквизитовБанка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефоныБанка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ФинансыСервер/Module.bsl
//	LNK 20.02.2017 11:25:49
Функция СписокДоступныхКасс(Пользователь = Неопределено, Организация = Неопределено, ВернутьСписокЗначений = Ложь)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если ВернутьСписокЗначений = Истина Тогда

			СписокКасс = Новый СписокЗначений;

	Иначе	СписокКасс = Новый Массив;

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Кассы.Ссылка КАК Касса,
	|	Кассы.Наименование КАК КлючПорядка
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	НЕ Кассы.ПометкаУдаления
	|	И НЕ Кассы.КассаУправляющейСистемы
	|	И Кассы.Магазин = ВЫБОР
	|			КОГДА &Магазин = НЕОПРЕДЕЛЕНО
	|				ТОГДА ВЫРАЗИТЬ(&Пользователь КАК Справочник.Пользователи).Магазин
	|			ИНАЧЕ &Магазин
	|		КОНЕЦ
	|	И Кассы.Владелец = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлючПорядка"
	);
	Запрос.УстановитьПараметр("Магазин", ?(ОбменДаннымиПовтИсп.ЭтоГлавныйУзел(), Неопределено, ПараметрыСеанса.ТекущийМагазин));
	Запрос.УстановитьПараметр("Пользователь", ?(Пользователь = Неопределено, Пользователи.ТекущийПользователь(), Пользователь));
	Запрос.УстановитьПараметр("Организация" , ?(Организация = Неопределено , ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация, Запрос.Параметры.Пользователь), Организация));
	
	Если ВернутьСписокЗначений = Истина Тогда

			СписокКасс.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Касса"));

	Иначе	СписокКасс = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Касса");

	КонецЕсли;

	Возврат СписокКасс;

КонецФункции // СписокДоступныхКасс()

//	LNK 23.03.2017 15:02:48
Функция СписокДоступныхРасчетныхСчетов(Организация, КассаИлиМагазин, ВернутьСписокЗначений = Ложь, ДатаДокумента= Неопределено)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если ВернутьСписокЗначений = Истина Тогда

			СписокСчетов = Новый СписокЗначений;

	Иначе	СписокСчетов = Новый Массив;

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Входящие.Магазин КАК Магазин
	|ПОМЕСТИТЬ Фильтр
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА &КассаИлиМагазин ССЫЛКА Справочник.Кассы
	|				ТОГДА ВЫРАЗИТЬ(&КассаИлиМагазин КАК Справочник.Кассы).Магазин
	|			ИНАЧЕ &КассаИлиМагазин
	|		КОНЕЦ КАК Магазин) КАК Входящие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Фильтр КАК Фильтр
	|		ПО (БанковскиеСчета.ОбособленноеПодразделениеОрганизации = Фильтр.Магазин.ОбособленноеПодразделениеОрганизации
	|				ИЛИ БанковскиеСчета.ОбособленноеПодразделениеОрганизации = ЗНАЧЕНИЕ(Справочник.ОбособленныеПодразделенияОрганизаций.ПустаяСсылка))
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Организация
	|	И НЕ БанковскиеСчета.ПометкаУдаления"
	);
	Запрос.УстановитьПараметр("Организация"    , Организация);
	Запрос.УстановитьПараметр("КассаИлиМагазин", КассаИлиМагазин);
	
	//А++ 20241127 по задаче занес проверку на дату закрытия счёта
	Если НЕ ДатаДокумента= Неопределено 
		и не Пользователи.ЭтоПолноправныйПользователь() 
		Тогда
		Запрос.Текст = Запрос.Текст +" И НАЧАЛОПЕРИОДА(БанковскиеСчета.ДатаЗакрытия, ДЕНЬ) > КОНЕЦПЕРИОДА(&ДатаЗакрытия, ДЕНЬ) ИЛИ НЕ БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1,1,1) ";		
		Запрос.УстановитьПараметр("ДатаЗакрытия"    , ДатаДокумента);
	КонецЕсли;
	//А++ 20241127 по задаче занес проверку на дату закрытия счёта
	
	Если ВернутьСписокЗначений = Истина Тогда

			СписокСчетов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));

	Иначе	СписокСчетов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	КонецЕсли;
	
	Возврат СписокСчетов;

КонецФункции // СписокДоступныхРасчетныхСчетов()

//	LNK 20.02.2017 13:26:17
Функция СписокПоследнихОснованийХозяйственнойОперации(Касса, ВидДокумента, ХозяйственнаяОперация, ВернутьСписокЗначений = Ложь)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если ВернутьСписокЗначений = Истина Тогда

			СписокОснований = Новый СписокЗначений;

	Иначе	СписокОснований = Новый Массив;

	КонецЕсли;

	Запрос = Новый Запрос(СтрЗаменить(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	|	ТаблицаДокументы.Дата КАК Дата,
	|	ТаблицаДокументы.Основание КАК Основание
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК ТаблицаДокументы
	|ГДЕ
	|	ТаблицаДокументы.Касса = &Касса
	|	И ТаблицаДокументы.Проведен
	|	И ТаблицаДокументы.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	И НЕ ТаблицаДокументы.Основание = """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ"
	, "Документ.РасходныйКассовыйОрдер КАК", "Документ." + ВидДокумента + " КАК")
	);
	Запрос.УстановитьПараметр("Касса", Касса);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Если СписокОснований.Количество() = 10 Тогда

			Прервать;

		КонецЕсли;

		Если ВернутьСписокЗначений = Истина Тогда

			Если СписокОснований.НайтиПоЗначению(Выборка.Основание) = Неопределено Тогда

				СписокОснований.Добавить(Выборка.Основание);

			КонецЕсли;

		Иначе

			Если СписокОснований.Найти(Выборка.Основание) = Неопределено Тогда

				СписокОснований.Добавить(Выборка.Основание);

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	СписокОснований.Добавить(ФинансыПовтИсп.ТекстОснованияХозяйственнойОперации(ХозяйственнаяОперация));

	Возврат СписокОснований;

КонецФункции // СписокПоследнихОснованийХозяйственнойОперации()

//	LNK 20.02.2017 15:41:44
Функция СписокПоследнихОтветственныхЛиц(Касса, ВидДокумента, ОтветственноеЛицо, ВернутьСписокЗначений = Ложь)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если ВернутьСписокЗначений = Истина Тогда

			СписокОтветственныхЛиц = Новый СписокЗначений;

	Иначе	СписокОтветственныхЛиц = Новый Массив;

	КонецЕсли;

	Запрос = Новый Запрос(СтрЗаменить(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	|	ТаблицаДокументы.Дата КАК Дата,
	|	ТаблицаДокументы.Ссылка КАК Ссылка,
	|	ТаблицаДокументы.ГлавныйБухгалтер КАК ГлавныйБухгалтер
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК ТаблицаДокументы
	|ГДЕ
	|	ТаблицаДокументы.Касса = &Касса
	|	И ТаблицаДокументы.Проведен
	|	И НЕ ТаблицаДокументы.ГлавныйБухгалтер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	Ссылка УБЫВ"
	, "Документ.РасходныйКассовыйОрдер КАК", "Документ." + ВидДокумента + " КАК")
	);
	Запрос.УстановитьПараметр("Касса", Касса);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Если СписокОтветственныхЛиц.Количество() = 10 Тогда

			Прервать;

		КонецЕсли;

		Если ВернутьСписокЗначений = Истина Тогда

			Если СписокОтветственныхЛиц.НайтиПоЗначению(Выборка.ГлавныйБухгалтер) = Неопределено Тогда

				СписокОтветственныхЛиц.Добавить(Выборка.ГлавныйБухгалтер);

			КонецЕсли;

		Иначе

			Если СписокОтветственныхЛиц.Найти(Выборка.ГлавныйБухгалтер) = Неопределено Тогда

				СписокОтветственныхЛиц.Добавить(Выборка.ГлавныйБухгалтер);

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Возврат СписокОтветственныхЛиц;

КонецФункции // СписокПоследнихОтветственныхЛиц()
